In [2]:
try:
    file = open('data.csv','x')
    file.close()
except:
    print("The file is already there!")

The file is already there!

In [3]:
import pandas as pd
df = pd.read_csv('data.csv')
df

   sn    name  age        add       phone
0   1     Ram   34  Kathmandu  9808778765
1   2   Shyam   56  Bhaktapur  9808667654
2   3    Hari   34   Lalitpur  9808445432
3   4   Sabin   23      Jhapa   980778765
4   5  Rakesh   43      Damak  9845667654
5   6   Nabin   33    Chitwan  9808667654

In [4]:
import pandas as pd
df = pd.read_csv('data.csv', nrows = 4)
df

   sn   name  age        add       phone
0   1    Ram   34  Kathmandu  9808778765
1   2  Shyam   56  Bhaktapur  9808667654
2   3   Hari   34   Lalitpur  9808445432
3   4  Sabin   23      Jhapa   980778765

In [5]:
import pandas as pd
df = pd.read_csv('data.csv')
df.head(4)
#df.tail()

   sn   name  age        add       phone
0   1    Ram   34  Kathmandu  9808778765
1   2  Shyam   56  Bhaktapur  9808667654
2   3   Hari   34   Lalitpur  9808445432
3   4  Sabin   23      Jhapa   980778765

In [7]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df.head(4)
#df.tail()

     name  age        add       phone
sn
1     Ram   34  Kathmandu  9808778765
2   Shyam   56  Bhaktapur  9808667654
3    Hari   34   Lalitpur  9808445432
4   Sabin   23      Jhapa   980778765

In [8]:
df = pd.read_csv('data.csv',usecols = ['sn','name','phone'])
df

   sn    name       phone
0   1     Ram  9808778765
1   2   Shyam  9808667654
2   3    Hari  9808445432
3   4   Sabin   980778765
4   5  Rakesh  9845667654
5   6   Nabin  9808667654

In [12]:
#iloc
import pandas as pd
df = pd.read_csv('data.csv')
df.iloc[2:5]
#df

   sn    name  age       add       phone
2   3    Hari   34  Lalitpur  9808445432
3   4   Sabin   23     Jhapa   980778765
4   5  Rakesh   43     Damak  9845667654

In [13]:
import pandas as pd
df = pd.read_csv('data.csv')
df.iloc[2:5,0:4]

   sn    name  age       add
2   3    Hari   34  Lalitpur
3   4   Sabin   23     Jhapa
4   5  Rakesh   43     Damak

In [15]:
#loc
df = pd.read_csv('data.csv',index_col = 'sn')
df.loc[2:5]

      name  age        add       phone
sn
2    Shyam   56  Bhaktapur  9808667654
3     Hari   34   Lalitpur  9808445432
4    Sabin   23      Jhapa   980778765
5   Rakesh   43      Damak  9845667654

In [17]:
#loc
df = pd.read_csv('data.csv',index_col = 'name')
df.loc['Hari':'Rakesh']

        sn  age       add       phone
name
Hari     3   34  Lalitpur  9808445432
Sabin    4   23     Jhapa   980778765
Rakesh   5   43     Damak  9845667654

In [19]:
#filter
df = pd.read_csv('data.csv')
df['name']

0       Ram
1     Shyam
2      Hari
3     Sabin
4    Rakesh
5     Nabin
Name: name, dtype: object

In [20]:
df['name'] == 'Ram'

0     True
1    False
2    False
3    False
4    False
5    False
Name: name, dtype: bool

In [21]:
df[df['name'] == 'Ram']

   sn name  age        add       phone
0   1  Ram   34  Kathmandu  9808778765

In [22]:
df[df['add'] == 'Kathmandu']

   sn name  age        add       phone
0   1  Ram   34  Kathmandu  9808778765

In [23]:
df[df['age'] >= 40]

   sn    name  age        add       phone
1   2   Shyam   56  Bhaktapur  9808667654
4   5  Rakesh   43      Damak  9845667654

In [25]:
df[(df['age'] >= 30) & (df['add'] == 'Kathmandu')]

   sn name  age        add       phone
0   1  Ram   34  Kathmandu  9808778765

In [2]:
data = [['sn','name','age','add'],
       [1,'Ram',34,'Kathmandu'],
       [2,'Shyam',67,'Bhaktapur'],
        [3,'Hari',67,'Lalitpur']]
data

[['sn', 'name', 'age', 'add'],
 [1, 'Ram', 34, 'Kathmandu'],
 [2, 'Shyam', 67, 'Bhaktapur'],
 [3, 'Hari', 67, 'Lalitpur']]

In [3]:
import csv
file = open('data2.csv','w')
x = csv.writer(file)
x.writerows(data)
file.close()

In [4]:
import pandas as pd
df = pd.read_csv('data2.csv')
df

   sn   name  age        add
0   1    Ram   34  Kathmandu
1   2  Shyam   67  Bhaktapur
2   3   Hari   67   Lalitpur

In [5]:
data = {'name':['Ram','Shyam','Hari'],
       'age':[45,67,43],
       'add':["Kathmandu","Bhaktapur","lalitpur"]}
data

{'name': ['Ram', 'Shyam', 'Hari'],
 'age': [45, 67, 43],
 'add': ['Kathmandu', 'Bhaktapur', 'lalitpur']}

In [7]:
df = pd.DataFrame(data)
df

    name  age        add
0    Ram   45  Kathmandu
1  Shyam   67  Bhaktapur
2   Hari   43   lalitpur

In [8]:
df.to_csv('data3.csv')

In [19]:
import csv
csv_columns = ['Name', 'Age', 'Address']
dict = [
    {'Name':'Aayush','Age':23,'Address':'Katmandu'},
    {'Name':'Shyam','Age':33,'Address':'Patan'}
]
csvfile = open("data.csv", 'w')
writer = csv.DictWriter(csvfile, fieldnames=csv_columns)
writer.writeheader()
for data in dict:
    writer.writerow(data)
csvfile.close()

In [12]:
data1 = {'name':['Ram','Shyam','Hari'],
       'age':[45,67,43],
       'add':["Kathmandu","Bhaktapur","lalitpur"]}
df1 = pd.DataFrame(data1)

data2 = {'name':['Rama','Shyama','Hira'],
       'age':[45,67,43],
       'add':["Kathmandu","Bhaktapur","lalitpur"]}
df2 = pd.DataFrame(data2)
df = pd.concat([df1,df2])
# df = df1 +df2
df

     name  age        add
0     Ram   45  Kathmandu
1   Shyam   67  Bhaktapur
2    Hari   43   lalitpur
0    Rama   45  Kathmandu
1  Shyama   67  Bhaktapur
2    Hira   43   lalitpur

In [14]:
df = df.rename(columns = {'name':'Name','age':'Age','add':'Add'})
df

     Name  Age        Add
0     Ram   45  Kathmandu
1   Shyam   67  Bhaktapur
2    Hari   43   lalitpur
0    Rama   45  Kathmandu
1  Shyama   67  Bhaktapur
2    Hira   43   lalitpur

In [17]:
row , col = df.shape
print("No of rows = ",row)
print("No os col = ",col)

No of rows =  6
No os col =  3

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   Add     6 non-null      object
dtypes: int64(1), object(2)
memory usage: 192.0+ bytes